; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v5)
		(pred_2 ?v2)
		(pred_5 ?v7)
		(pred_4 ?v7)
		(pred_6 ?v2 ?v7)
		(pred_3)
		(pred_1 ?v2))

   (:action op_1
       :parameters  (?v6 ?v1)
       :precondition (and (not-eq ?v6 ?v1) 
                          (pred_5 ?v6) (pred_5 ?v1) (pred_4 ?v6))
       :effect (and  (pred_4 ?v1)
		     (not (pred_4 ?v6))))


   (:action op_3
       :parameters (?v3 ?v8)
       :precondition  (and  (pred_2 ?v3) (pred_5 ?v8)
			    (pred_6 ?v3 ?v8) (pred_4 ?v8) (pred_3))
       :effect (and (pred_1 ?v3)
		    (not (pred_6 ?v3 ?v8)) 
		    (not (pred_3))))

   (:action op_2
       :parameters  (?v3  ?v8)
       :precondition  (and  (pred_2 ?v3) (pred_5 ?v8)
			    (pred_1 ?v3) (pred_4 ?v8))
       :effect (and (pred_6 ?v3 ?v8)
		    (pred_3)
		    (not (pred_1 ?v3)))))

; problem
(define (problem ferry-l5-c3)
(:domain ferry)
(:objects obj_04 obj_01 obj_06 obj_03 obj_08 
          obj_07 obj_02 obj_05 
)
(:init
(pred_5 obj_04)
(pred_5 obj_01)
(pred_5 obj_06)
(pred_5 obj_03)
(pred_5 obj_08)
(pred_2 obj_07)
(pred_2 obj_02)
(pred_2 obj_05)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_01 obj_06)
(not-eq obj_06 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(pred_3)
(pred_6 obj_07 obj_01)
(pred_6 obj_02 obj_08)
(pred_6 obj_05 obj_08)
(pred_4 obj_01)
)
(:goal
(and
(pred_6 obj_07 obj_06)
(pred_6 obj_02 obj_08)
(pred_6 obj_05 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_6 obj_07 obj_06) (pred_4 obj_04))
    (sometime-before  (pred_6 obj_05 obj_03) (pred_4 obj_04))
  )
)
)

; plan
1. (op_1 obj_01 obj_08)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_08)
   goals met: 1 of 3
2. (op_3 obj_05 obj_08)
   deleted: (pred_6 obj_05 obj_08) (pred_3)
   added: (pred_1 obj_05)
   goals met: 1 of 3
3. (op_1 obj_08 obj_06)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_06)
   goals met: 1 of 3
4. (op_2 obj_05 obj_06)
   deleted: (pred_1 obj_05)
   added: (pred_6 obj_05 obj_06) (pred_3)
   goals met: 1 of 3
5. (op_1 obj_06 obj_01)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_01)
   goals met: 1 of 3
6. (op_3 obj_07 obj_01)
   deleted: (pred_6 obj_07 obj_01) (pred_3)
   added: (pred_1 obj_07)
   goals met: 1 of 3
7. (op_1 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_04)
   goals met: 1 of 3
8. (op_2 obj_07 obj_04)
   deleted: (pred_1 obj_07)
   added: (pred_6 obj_07 obj_04) (pred_3)
   goals met: 1 of 3
9. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_06)
   goals met: 1 of 3
10. (op_3 obj_05 obj_06)
   deleted: (pred_6 obj_05 obj_06) (pred_3)
   added: (pred_1 obj_05)
   goals met: 1 of 3
11. (op_1 obj_06 obj_03)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_03)
   goals met: 1 of 3
12. (op_2 obj_05 obj_03)
   deleted: (pred_1 obj_05)
   added: (pred_6 obj_05 obj_03) (pred_3)
   goals met: 2 of 3
13. (op_1 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_04)
   goals met: 2 of 3
14. (op_3 obj_07 obj_04)
   deleted: (pred_6 obj_07 obj_04) (pred_3)
   added: (pred_1 obj_07)
   goals met: 2 of 3
15. (op_1 obj_04 obj_06)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_06)
   goals met: 2 of 3
16. (op_2 obj_07 obj_06)
   deleted: (pred_1 obj_07)
   added: (pred_6 obj_07 obj_06) (pred_3)
   goals met: 3 of 3
